posts/permanent/20230416154043-create_ob_phpstan/index.html
<!doctype html><html lang=ja-jp dir=ltr prefix="og: https://ogp.me/ns#"><head><meta charset=utf-8><meta name=viewport content="width=device-width,initial-scale=1"><meta name=color-scheme content="dark"><meta name=theme-color content="#282a36"><meta name=Hatena::Bookmark content="nocomment"><title itemprop=name>ob-phpstanを作った | takeokunn's blog</title><meta property="og:title" content="ob-phpstanを作った | takeokunn's blog"><meta name=twitter:title content="ob-phpstanを作った | takeokunn's blog"><meta itemprop=name content="ob-phpstanを作った | takeokunn's blog"><meta name=application-name content="takeokunn's blog"><meta property="og:site_name" content="takeokunn's blog"><meta property="og:url" content="https://www.takeokunn.org/posts/permanent/20230416154043-create_ob_phpstan/"><meta name=description content="ob-phpstanを作った"><meta itemprop=description content="ob-phpstanを作った"><meta property="og:description" content="ob-phpstanを作った"><meta name=twitter:description content="ob-phpstanを作った"><meta property="og:locale" content="ja_JP"><meta name=language content="ja-jp"><link rel=alternate hreflang=ja-jp href=https://www.takeokunn.org/posts/permanent/20230416154043-create_ob_phpstan/ title=Japanese><meta property="og:type" content="article"><meta property="article:published_time" content="2023-04-16T09:00:00+09:00"><meta property="article:modified_time" content="2023-04-16T09:00:00+09:00"><meta property="article:author" content="takeokunn"><meta name=author content="takeokunn"><meta property="article:tag" content="Emacs"><meta property="article:tag" content="Org-Mode"><meta itemprop=image content="https://www.takeokunn.org/ogp/20230416154043-create_ob_phpstan.png"><meta property="og:image" content="https://www.takeokunn.org/ogp/20230416154043-create_ob_phpstan.png"><meta name=twitter:image content="https://www.takeokunn.org/ogp/20230416154043-create_ob_phpstan.png"><meta name=twitter:card content="summary_large_image"><link rel=canonical href=https://www.takeokunn.org/posts/permanent/20230416154043-create_ob_phpstan/><link rel=alternate type=application/rss+xml href=/index.xml title="takeokunn's blog"><link href=/style.min.63589836b2fadb0abcc163013176a886f91509f3130902fad690cfc3f5dcf707.css rel=stylesheet><link href=/code-highlight.min.ca0d5ee203390cf1a8d6b0b0204024fa2424a020fd6554c7df0c2a572e19c583.css rel=stylesheet><link rel=icon href=/favicon.ico sizes=32x32></head><body><a class=skip-link href=#main-content>本文へスキップ</a><header class=navbar><nav class=menu aria-label=メインナビゲーション><a href=/ class=logo aria-label="takeokunn's blog"><svg width="25" height="25" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="feather feather-home" aria-hidden="true" focusable="false"><title>Home</title><path d="M3 9l9-7 9 7v11a2 2 0 01-2 2H5a2 2 0 01-2-2z"/><polyline points="9 22 9 12 15 12 15 22"/></svg>
</a><button type=button class=menu-toggle aria-expanded=false aria-controls=site-menu>
<span class=menu-icon aria-hidden=true><svg width="25" height="25" stroke="currentColor" fill="none" viewBox="0 0 14 14" aria-hidden="true" focusable="false"><title>Menu</title><path stroke-linecap="round" stroke-linejoin="round" d="M10.595 7H3.40726"/><path stroke-linecap="round" stroke-linejoin="round" d="M10.5096 3.51488H3.49301"/><path stroke-linecap="round" stroke-linejoin="round" d="M10.5096 10.4851H3.49301"/><path stroke-linecap="round" stroke-linejoin="round" d="M.5 12.5V1.5c0-.552285.447715-1 1-1h11C13.0523.5 13.5.947715 13.5 1.5v11C13.5 13.0523 13.0523 13.5 12.5 13.5H1.5C.947715 13.5.5 13.0523.5 12.5z"/></svg>
</span><span class=visually-hidden>メニューを開く</span></button><div class=trigger id=site-menu><button type=button class=menu-close-button aria-label=メニューを閉じる>
<span aria-hidden=true>&#215;</span></button><ul class=trigger-container><li><a class=menu-link href=/>Home</a></li><li><a class="menu-link active" href=/posts/ aria-current=page>Posts</a></li><li><a class=menu-link href=/graph/>Graph</a></li></ul></div></nav></header><div class="wrapper post"><main id=main-content tabindex=-1 class=page-content><article><header class=header><h1 class=header-title>ob-phpstanを作った</h1><div class=post-meta><time datetime=2023-04-16T09:00:00+09:00 itemprop=datePublished><span class=visually-hidden>公開日: </span>2023.4.16</time></div><ul class=tags aria-label=記事のタグ><li><a href=/tags/emacs/>Emacs</a></li><li><a href=/tags/org-mode/>Org-Mode</a></li></ul></header><details class=toc><summary><b>目次</b></summary><nav id=TableOfContents><ul><li><a href=#introduction>Introduction</a></li><li><a href=#使い方>使い方</a></li><li><a href=#実装方法について>実装方法について</a></li><li><a href=#conclusion>Conclusion</a></li></ul></nav></details><div class=page-content><h2 id=introduction>Introduction</h2><p>最近<a href=https://phpstan.org/>phpstan</a>を弄ることが増えたのですが、逐一<a href=https://phpstan.org/try>playground</a>を開いてWebエディタ内で編集をするのが面倒に感じていました。
org-mode内で完結をするようにしたいと考えるのはEmacsユーザーなら当然の発想です。
そこで今回は <code>org-babel</code> 経由でphpstanの実行結果をorg内で管理できるようにしました。</p><h2 id=使い方>使い方</h2><p><a href=https://github.com/emacs-php/ob-phpstan>https://github.com/emacs-php/ob-phpstan</a></p><p>2023/04/16現在、melpaにはまだ登録をしていないので各自で落してきてパスを通してください。</p><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-emacs-lisp data-lang=emacs-lisp><span style=display:flex><span>(add-to-list <span style=color:#e6db74>&#39;load-path</span> <span style=color:#e6db74>&#34;/path/to/ob-phpstan.el&#34;</span>)
</span></span><span style=display:flex><span>(require <span style=color:#e6db74>&#39;ob-phpstan</span>)
</span></span></code></pre></div><p>次に <code>php-mode</code> を派生させた <code>phpstan-mode</code> を作成してください。</p><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-emacs-lisp data-lang=emacs-lisp><span style=display:flex><span>(eval-after-load <span style=color:#e6db74>&#34;org&#34;</span> <span style=color:#f92672>&#39;</span>(add-to-list <span style=color:#e6db74>&#39;org-src-lang-modes</span> <span style=color:#f92672>&#39;</span>(<span style=color:#e6db74>&#34;phpstan&#34;</span> <span style=color:#f92672>.</span> phpstan)))
</span></span></code></pre></div><p><code>org-babel-phpstan-command</code> に各自で <code>phpstan</code> へのパスを設定してください。</p><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-emacs-lisp data-lang=emacs-lisp><span style=display:flex><span>(with-eval-after-load <span style=color:#e6db74>&#39;ob-phpstan</span>
</span></span><span style=display:flex><span>  (setq org-babel-phpstan-command <span style=color:#e6db74>&#34;/path/to/dir/phpstan&#34;</span>))
</span></span></code></pre></div><p>あとは適宜orgファイル内でコードブロック作成し、 <code>org-babel</code> を実行してください。</p><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-org data-lang=org><span style=display:flex><span><span style=color:#75715e>#+begin_src </span><span style=color:#75715e>phpstan</span><span style=color:#75715e> :level 0
</span></span></span><span style=display:flex><span><span style=color:#75715e></span>  class HelloWorld
</span></span><span style=display:flex><span>  {
</span></span><span style=display:flex><span>          public function sayHello(DateTimeImutable $date): void
</span></span><span style=display:flex><span>          {
</span></span><span style=display:flex><span>                  echo &#39;Hello, &#39; . $date-&gt;format(&#39;j. n. Y&#39;);
</span></span><span style=display:flex><span>          }
</span></span><span style=display:flex><span>  }
</span></span><span style=display:flex><span><span style=color:#75715e>#+end_src</span>
</span></span><span style=display:flex><span>
</span></span><span style=display:flex><span><span style=color:#75715e>#+RESULTS</span><span style=color:#75715e>:</span>
</span></span><span style=display:flex><span><span style=color:#75715e>#+begin_example</span>
</span></span><span style=display:flex><span> ------ ----------------------------------------------------------------------------------
</span></span><span style=display:flex><span>  Line   /var/folders/z5/sk1q5qj96xg4g87vkcp4hq9h0000gn/T/babel-TGYZJB/phpstan-ulqeYI.php
</span></span><span style=display:flex><span> ------ ----------------------------------------------------------------------------------
</span></span><span style=display:flex><span>  4      Parameter $date of method HelloWorld::sayHello() has invalid type
</span></span><span style=display:flex><span>         DateTimeImutable.
</span></span><span style=display:flex><span> ------ ----------------------------------------------------------------------------------
</span></span><span style=display:flex><span>
</span></span><span style=display:flex><span>
</span></span><span style=display:flex><span> [ERROR] Found 1 error
</span></span><span style=display:flex><span>
</span></span><span style=display:flex><span><span style=color:#75715e>#+end_example</span>
</span></span></code></pre></div><h2 id=実装方法について>実装方法について</h2><p><code>ob-phpstan</code> は100行にも満たない小さなコードで実装されています。
<a href=https://github.com/emacs-php/ob-phpstan/blob/main/ob-phpstan.el>https://github.com/emacs-php/ob-phpstan/blob/main/ob-phpstan.el</a></p><ul><li><code>org-babel-temp-file</code> で一時ファイルを作成</li><li>コードブロックの頭に <code>&lt;?php</code> を追加</li><li><code>with-temp-file</code> を使って一時ファイルに文字列を追加</li><li><code>org-babel-eval</code> でphpstanを実行</li></ul><div class=highlight><pre tabindex=0 style=color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4><code class=language-emacs-lisp data-lang=emacs-lisp><span style=display:flex><span>(defun org-babel-execute:phpstan (body params)
</span></span><span style=display:flex><span>  <span style=color:#e6db74>&#34;Org mode fish evaluate function&#34;</span>
</span></span><span style=display:flex><span>  (let ((tmp-file (org-babel-temp-file <span style=color:#e6db74>&#34;phpstan-&#34;</span> <span style=color:#e6db74>&#34;.php&#34;</span>))
</span></span><span style=display:flex><span>        (body (<span style=color:#a6e22e>concat</span> <span style=color:#e6db74>&#34;&lt;?php\n&#34;</span> body))
</span></span><span style=display:flex><span>        (level (or (<span style=color:#a6e22e>cdr</span> (<span style=color:#a6e22e>assoc</span> :level params)) org-babel-phpstan-level)))
</span></span><span style=display:flex><span>    (with-temp-file tmp-file (<span style=color:#a6e22e>insert</span> (org-babel-expand-body:generic body params)))
</span></span><span style=display:flex><span>    (org-babel-eval (<span style=color:#a6e22e>format</span> <span style=color:#e6db74>&#34;%s analyze %s --level %s --no-progress&#34;</span>
</span></span><span style=display:flex><span>                            org-babel-phpstan-command
</span></span><span style=display:flex><span>                            (org-babel-process-file-name tmp-file)
</span></span><span style=display:flex><span>                            level)
</span></span><span style=display:flex><span>                    <span style=color:#e6db74>&#34;&#34;</span>)))
</span></span></code></pre></div><p>phpstanの場合、標準入力でプログラムを渡す方法ではなく、ファイルパスを指定する方法しかありません。
以前<a href=https://github.com/takeokunn/ob-fish>ob-fish</a>を作ったが、 <code>org-babel</code> 周りの知識はからっきしなので <a href=https://github.com/lurdan/ob-typescript>ob-typescript</a> を参考に実装しました。</p><h2 id=conclusion>Conclusion</h2><p>melpaに申請をしたり、ドキュメントを整えたり、まだやることが残っているので順次進めていきます。</p><p>今回の実装を通じて <code>org-babel</code> 周りに詳しくなれました。
<code>org-babel</code> の実装方法やまとまったドキュメントは存在していないので機会があれば書こうと思いました。</p></div></article><nav class=post-nav aria-label="前の記事 / 次の記事"><a class=post-nav-item href=/posts/diary/20230327015058-phperkaigi_2023_report/ rel=prev><div class=nav-arrow>← 前の記事</div><span class=post-title>phperkaigi 2023でパンフレット記事寄稿&登壇してきました</span>
</a><a class=post-nav-item href=/posts/diary/20230624093617-retrospective_phpconference_fukuoka_2023/ rel=next><div class=nav-arrow>次の記事 →</div><span class=post-title>phpカンファレンス福岡2023に参加してきました</span></a></nav></main></div><button id=totop type=button aria-label=ページの先頭へ戻る hidden>
<svg width="40" height="40" fill="currentColor" stroke="currentColor" viewBox="0 96 960 960" aria-hidden="true" focusable="false"><path d="M283 704.739 234.261 656 480 410.261 725.739 656 677 704.739l-197-197-197 197z"/></svg></button><footer class=footer><div class=footer_social-icons><a href=https://zenn.dev/takeokunn target=_blank rel="noopener noreferrer me" title=Zenn aria-label="Visit Zenn profile"><svg viewBox="0 0 88 88" aria-hidden="true" focusable="false"><path d="M2.22 83.478h17.632c1.296.0 2.16-.576 2.952-1.584L67.906 17.092c.576-.864.288-1.728-.576-1.728H51.946c-1.008.0-1.656.432-2.304 1.296L3.948 81.606c-.648.936-.288 1.872.864 1.872H2.22z" fill="currentColor"/><path d="M54.106 83.478h15.336c1.152.0 1.656-.36 1.656-1.224.0-.36-.144-.792-.432-1.296l-18-28.208c-.504-.792-1.296-.792-1.944.0L42.73 65.998c-.432.72-.36 1.512.144 2.304l8.928 14.112c.504.72 1.152 1.064 2.304 1.064z" fill="currentColor"/></svg>
</a><a href=https://x.com/takeokunn/ target=_blank rel="noopener noreferrer me" title=Twitter aria-label="Visit Twitter profile"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" focusable="false"><path d="M23 3a10.9 10.9.0 01-3.14 1.53 4.48 4.48.0 00-7.86 3v1A10.66 10.66.0 013 4s-4 9 5 13a11.64 11.64.0 01-7 2c9 5 20 0 20-11.5a4.5 4.5.0 00-.08-.83A7.72 7.72.0 0023 3z"/></svg>
</a><a href=https://github.com/takeokunn target=_blank rel="noopener noreferrer me" title=GitHub aria-label="Visit GitHub profile"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" focusable="false"><path d="M9 19c-5 1.5-5-2.5-7-3m14 6v-3.87a3.37 3.37.0 00-.94-2.61c3.14-.35 6.44-1.54 6.44-7A5.44 5.44.0 0020 4.77 5.07 5.07.0 0019.91 1S18.73.65 16 2.48a13.38 13.38.0 00-7 0C6.27.65 5.09 1 5.09 1A5.07 5.07.0 005 4.77 5.44 5.44.0 003.5 8.55c0 5.42 3.3 6.61 6.44 7A3.37 3.37.0 009 18.13V22"/></svg>
</a><a href=https://keyoxide.org/0B10DAA7BA0236D7382287660F79C0AB03FD7A1C target=_blank rel="noopener noreferrer me" title=Keyoxide aria-label="Visit Keyoxide profile"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" focusable="false"><path d="M21 2l-2 2m-7.61 7.61a5.5 5.5.0 11-7.778 7.778 5.5 5.5.0 017.777-7.777zm0 0L15.5 7.5m0 0 3 3L22 7l-3-3m-3.5 3.5L19 4"/></svg>
</a><a href=/index.xml target=_blank rel="noopener noreferrer" title=RSS aria-label="Subscribe via RSS"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true" focusable="false"><path d="M4 11a9 9 0 019 9"/><path d="M4 4a16 16 0 0116 16"/><circle cx="5" cy="19" r="1"/></svg></a></div><small class=footer_copyright><span>© 2026 takeokunn</span>
<span class=footer_divider aria-hidden=true>•</span>
<span>Powered by <a href=https://github.com/takeokunn/hugo-take-theme target=_blank rel="noopener noreferrer">hugo-take-theme</a></span></small></footer><script src=/js/main.min.325fdac6633acd0d98555157e54930e0f7939c5a08cadc42b24f750343fcdba0.js integrity="sha256-Ml/axmM6zQ2YVVFX5Ukw4PeTnFoIytxCsk91A0P826A=" defer></script></body></html>